[Weapon.WeaponType_GyrocopterGun WeaponTypeDefinition]
Typename="Semi-automatic precision weapons"
PickupMessage="accompanied by %s"
UseFailureLevelMessage="You must be at least %d level to use this feature.."
UseFailureConstraintsMessage="You cannot use this item."
NoManufacturerName="generally"

[Weapon.WeaponType_GyrocopterGunStrong WeaponTypeDefinition]
Typename="semi-automatic sniper rifle"
PickupMessage="It is very rich %s"
UseFailureLevelMessage="You need at least %d before using this item."
UseFailureConstraintsMessage="This product is not available.."
NoManufacturerName="General |"

